Repository: palomarl/74531705
Catalog: omegat/project_save.tmx
Source language: en
Languages: es_es

source: Some vibes are so powerful they can cause women to have multiple orgasms.
es_es: Algunos vibradores son tan potentes que pueden provocar múltiples orgasmos a las mujeres.

source: Some women, however, prefer to leave them in place during the day.
es_es: Sin embargo, algunas mujeres prefieren dejarlas colocadas durante el día.

source: Sometimes the simple act of sexual pleasure is enough to satisfy.
es_es: A veces, el simple acto de placer sexual es suficiente para satisfacer.

source: Special squares like the Massage Parlor or Erotic Dancing challenge you to get physical.
es_es: Las casillas especiales, como el Salón de Masajes o el Baile Erótico, te retan a ponerte en forma.

source: Spray the bullet with sex toy cleaner and wipe it down with a soft cloth.
es_es: Rocía la bala con un spray limpiador de juguetes eróticos y límpiala con un paño suave.

source: Squeeze and release your muscles 4 more times to complete your set of Kegel exercises.
es_es: Apriete y suelte los músculos 4 veces más para completar la serie de ejercicios de Kegel.

source: Squeeze the balls with your pelvic floor muscles for 5 seconds.
es_es: Aprieta las pelotas con los músculos del suelo pélvico durante 5 segundos.

source: Squeeze, squeeze, squeeze your way to stronger kegel muscles – and increased erotic control, improved sensation, and your most powerful Ohh’s ever!
es_es: Aprieta, aprieta y aprieta para fortalecer los músculos kegel y aumentar el control erótico, mejorar las sensaciones y conseguir los Ohh más potentes de tu vida.

source: Start by getting in the mood.
es_es: Empieza por ponerte en situación.

source: Start slowly at first before picking up the pace as you become more and more aroused.
es_es: Empieza despacio al principio y acelera el ritmo a medida que te vayas excitando.

source: Stimulating multiple erogenous zones makes it much easier to have an orgasm.
es_es: Estimular varias zonas erógenas facilita mucho el orgasmo.

source: Store your sex toy and a spoonful of the renewal powder in a sealed plastic bag until next time.
es_es: Guarda el juguete y una cucharada del polvo renovador en una bolsa de plástico hermética hasta la próxima vez.

source: Strengthen & stimulate your kegel muscles
es_es: Fortalece y estimula los músculos kegel

source: Stroke your hand up and down your shaft in a pumping motion.
es_es: Sube y baja la mano por el pene con un movimiento de bombeo.

source: Surrender to temptation & toe-curling pleasure with this discreet stimulating apple!
es_es: Ríndete a la tentación y al placer con esta discreta manzana estimuladora.

source: Switching from long and slow strokes to short and fast ones makes masturbation feel more like sex.
es_es: Pasar de caricias largas y lentas a caricias cortas y rápidas hace que la masturbación se parezca más al sexo.

source: TPE and TPR
es_es: TPE y TPR

source: Take solo play to the next level with expert advice from certified sexologist Dr. Jenni Skyler.
es_es: Lleva la masturbación al siguiente nivel con consejos de la sexóloga certificada Dr. Jenni Skyler.

source: Take your fun to new heights by giving the remote to your partner and letting them take charge of your pleasure during date night.
es_es: Lleva la diversión a un nuevo nivel dándole el mando a distancia a tu pareja y deja que se encargue de tu placer durante una cita nocturna.

source: Tap the button to cycle through all 10 functions of air pulsation.
es_es: Toca el botón para pasar por las 10 funciones de pulsación de aire.

source: Targets your nipples with intense touchless puffs of air
es_es: - Apunta a tus pezones con intensas ráfagas de aire sin contacto

source: Taste forbidden pleasures with this discreet clitoral stimulator!
es_es: Saborea los placeres prohibidos con este discreto estimulador de clítoris.

source: Tempt 'em in sweet 'n' flirty sheer mesh and lace –– while partial foam-lined underwired cups lift & boost your beckoning bosom!
es_es: Tiéntalos con la dulce y coqueta tela transparente y el encaje, mientras las copas con aros y forradas parcialmente de espuma elevan y realzan tu atractivo pecho.

source: That can make buying lingerie more than a little confusing, especially if you're not sure what all the different terms mean.
es_es: Esto puede hacer un poco confusa la compra de lencería, sobre todo si no estás segura de lo que conlleva acda elección.

source: That could be anything from a steamy romance movie to an erotic novel.
es_es: Puede ser cualquier cosa, desde una película romántica hasta una novela erótica.

source: That’s why anal toys merit a little extra caution and care when it comes to cleaning than your average sex toy.
es_es: Por eso los juguetes anales merecen un poco más de precaución y cuidado a la hora de limpiarlos que los juguetes sexuales normales.

source: The "full" sensation from the balls combined with the jiggling weights is a great way to warm up.
es_es: La sensación de "plenitud" de las bolas combinada con el movimiento de las pesas es una forma estupenda de entrar en calor.

source: The Bang!
es_es: ¡El Bang!

source: The Drink and Food squares let you sip or nibble seductively.
es_es: Las casillas Bebida y Comida te permiten sorber o mordisquear seductoramente.

source: The Forbidden Apple can run up to 60 minutes, depending on your settings.
es_es: La Manzana Prohibida puede funcionar hasta 60 minutos, dependiendo de la configuración.

source: The Forbidden Apple has a built-in vibrator to add even more power and leave your bits tingling.
es_es: La Manzana Prohibida tiene un vibrador incorporado para añadir aún más potencia y dejar tus partes cosquilleando.

source: The Rechargeable Power Bullet is completely waterproof so you can use it almost anywhere you go.
es_es: La bala vibradora es totalmente resistente al agua, por lo que podrás utilizarla prácticamente en cualquier lugar.

source: The Rechargeable Power Bullet teases your bits like nothing else!
es_es: La Bala Recargable te hará excitarte como ninguna otra!

source: The Rose is crafted from super-smooth silicone, but you can add a little of your favorite water-based lubricant around the opening for extra comfort.
es_es: La rosa está hecha de silicona súper suave, pero puedes añadir un poco de tu lubricante favorito a base de agua alrededor de la abertura para mayor comodidad.

source: The Shegasm Forbidden Apple satisfies your clit, nipples, and other erogenous zones two different ways for the strongest possible O’s.
es_es: La Manzana Prohibida Shegasm satisface tu clítoris, pezones y otras zonas erógenas de dos maneras diferentes para obtener los orgasmos más intensos posibles.

source: The Strip square directs you to take off an article of clothing.
es_es: La casilla Desnúdate te obliga a quitarte una prenda de ropa.

source: The balls also provide resistance when you're squeezing your vaginal muscles.
es_es: Las bolas también proveen resistencia cuando estás apretando tus músculos vaginales.

source: The balls work best when they're inside you.
es_es: Las bolas funcionan mejor cuando están dentro de ti.

source: The bullet delivers powerful vibrations directly to your most sensitive erogenous zones – exactly where they do the most good.
es_es: La bala estimula directamente mediante vibraciones tus zonas erógenas más sensibles, exactamente donde te da más placer.

source: The bullet vibrator features 4 different speeds, ranging from foreplay-friendly all the way up to supercharged O. If you prefer the tickling sensation of a pattern, you can chose from 5 different ones – each sure to curl your toes!
es_es: La bala vibradora se distingue por sus 4 velocidades diferentes, que van desde una velocidad para los preliminares hasta el orgasmo más intenso. Si prefieres la sensación que proporciona un patrón puedes escoger entre 5 diferentes, cada uno de ellos te hará enloquecer!

source: The bullet’s discreet size makes it easy to hide.
es_es: El tamaño discreto de la bala hace que sea fácil de esconder.

source: The care of silk lingerie is more labor intensive and sometimes requires dry cleaning
es_es: El cuidado de la lencería de seda es más laborioso y a veces necesita un lavado en seco.

source: The chart lists the most popular sex toy materials along with recommendations from Adam & Eve’s toy experts for keeping them clean.
es_es: La tabla enumera los materiales más populares de los juguetes sexuales junto con las recomendaciones de los expertos en juguetes de Adam & Eve para mantenerlos limpios.

source: The egg features 10 different vibration modes.
es_es: El huevo cuenta con 10 modos de vibración diferentes.

source: The exercises are simple and discreet enough that you could easily do them in the car, during work, or binging on your favorite new show.
es_es: Los ejercicios son lo suficientemente simples y discretos para que los puedas hacer en el coche, durante el trabajo o viendo tu serie favorita.

source: The firm material provides resistance when you squeeze them for a more effective workout.
es_es: El material firme proporciona resistencia cuando las aprietas para un entrenamiento más eficaz.

source: The first one of you to collect six rings wins.
es_es: El primero que consiga seis anillos gana.

source: The intense and direct stimulation from a vibrator is a fast and easy way to get your partner in the mood.
es_es: La estimulación intensa y directa de un vibrador es una forma rápida y sencilla de excitar a tu pareja.

source: The intense power of a vibrator makes it easier for a woman to bridge the gap between sexual pleasure and having an orgasm.
es_es: La intensa potencia de un vibrador facilita que una mujer pase del placer sexual al orgasmo.

source: The longer you play, the steamier it gets.
es_es: Cuanto más tiempo juegues, más pasión habrá.

source: The main benefit of not masturbating is that you'll have a lot more time on your hands.
es_es: La principal ventaja de no masturbarte es que tendrás mucho más tiempo libre.

source: The more active you are, the more the weight moves.
es_es: Cuanto más activa seas, más se moverá el peso.

source: The most common side effect of masturbation is a deep sense of relaxation and rejuvenation, which is something we can all use!
es_es: El efecto secundario más común de la masturbación es una profunda sensación de relajación y de rejuvenecimiento, ¡que es algo que nos viene bien a todos!

source: The next time you have an orgasm, it will feel more powerful simply because you haven't had one in a while.
es_es: La próxima vez que tengas un orgasmo, te parecerá más potente simplemente porque hace tiempo que no lo tienes.

source: The pressured air gives your nipples a gentle yet ultra-effective stimulation for intense O’s.
es_es: El aire a presión proporciona a tus pezones una estimulación suave pero ultraeficaz para unos orgasmos intensos.

source: The remote lets you control it effortlessly without missing a beat… or getting caught with your hand down your pants!
es_es: El mando a distancia te permite controlarlo sin esfuerzo y sin perder el ritmo... ¡ni que te pillen con la mano en los pantalones!

source: The same goes for the remote if your toy comes with one.
es_es: Lo mismo ocurre con el mando a distancia, si el juguete incluye uno.

source: The sensitizer comes in a 0.5 oz bottle with a screw top.
es_es: El sensibilizador se presenta en un frasco de 0,5 oz con tapón de rosca.

source: The smooth egg slides easily between your lips, where it delivers waves of stimulating vibrations directly to some of your most sensitive spots.
es_es: El suave huevo se desliza fácilmente entre tus labios, donde envía ondas de vibraciones estimulantes directamente a algunos de tus puntos más sensibles.

source: The special agents in the cream work by targeting your nerves – increasing their sensitivity and responsiveness.
es_es: Los agentes especiales de la crema actúan sobre los nervios, aumentando su sensibilidad y capacidad de respuesta.

source: The tingling vibrations are just what you need for extra-strong O’s!
es_es: Estas vibraciones que producen un hormigueo son justo lo que necesitas para orgasmos extra fuertes!

source: The top-rated foreplay game for couples!
es_es: ¡El juego de preliminares para parejas mejor valorado!

source: The traditional method involves washing your toy in warm, soapy water, rinsing it off, and then drying it with a clean towel.
es_es: El método tradicional consiste en lavar el juguete con agua tibia y jabón, enjuagarlo y secarlo con una toalla limpia.

source: The waterproof design makes it easy to clean too.
es_es: Además, su diseño impermeable facilita su limpieza.

source: The waterproof seal makes the bullet easy to clean as well.
es_es: El hecho de que sea impermeable hace que la bala también sea fácil de limpiar.

source: The winner then has the opportunity to choose a super-hot and sexy fantasy to act out from the ‘Fantasy’ cards they’ve collected.
es_es: A continuación, el ganador tiene la oportunidad de elegir una fantasía supercaliente y sexy de entre las cartas de "Fantasía" que haya reunido.

source: Their timed-tested success has led to many doctors recommending them for their patients.
es_es: Su éxito probado en el tiempo ha hecho que muchos médicos las recomienden a sus pacientes.

source: Then gently place the opening over your nipples.
es_es: A continuación, coloca suavemente la abertura sobre tus pezones.

source: Then lightly dust it with the special renewal powder included with your toy.
es_es: A continuación, espolvoréalo ligeramente con el polvo renovador especial que se incluye con el juguete.

source: Then plug the charging cord into the base of the bullet and a USB port.
es_es: A continuación, conecta el cable de carga a la base de la bala y a un puerto USB.

source: Then take some time to familiarize yourself with how they feel.
es_es: Después, tómate un tiempo para familiarizarte con cómo se siente.

source: Then urinate to "flush the pipes."
es_es: Luego orina para "purgar las tuberías".

source: Then use the built-in pull cord to remove the egg.
es_es: A continuación, utiliza el cordón incorporado para extraer el huevo.

source: Then wipe it down with a damp cloth, paying particular attention to any cracks or crevices where germs might hide.
es_es: A continuación, pásale un paño húmedo, prestando especial atención a las grietas y hendiduras donde puedan esconderse los gérmenes.

source: Then you can wash it like normal, using a sex toy cleaner or warm, soapy water.
es_es: Después puedes lavarlo como de costumbre, con un limpiador de juguetes eróticos o con agua tibia y jabón.

source: There are dozens of places you can conceal it in your bedroom or bathroom where no one else would ever find it.
es_es: Existen docenas de lugares donde puedes ocultarlo, como en tu habitación o baño, donde nadie nunca podría encontrarlo.

source: There are multiple ways for women to masturbate.
es_es: Las mujeres pueden masturbarse de muchas maneras.

source: There are two basic ways to clean your sex toys.
es_es: Hay dos formas básicas de limpiar los juguetes eróticos.

source: There are vibrators shaped like penises for realistic fun and others shaped like common household items from lipstick to rubber ducks.
es_es: Hay vibradores que tienen forma de pene para que la diversión sea más realista, y otros con formas tan familiares, desde pintalabios a patitos de goma.

source: There's no right or wrong answer, but I do have some masturbation tips and advice to help you out.
es_es: No hay una respuesta correcta o incorrecta, pero tengo algunos consejos sobre masturbación que pueden ayudarte.

source: There’s absolutely 0% chance of you going blind or growing hairy palms after masturbating.
es_es: No hay absolutamente ninguna posibilidad de que te quedes ciego o de que te salgan pelos en las palmas de las manos después de masturbarte.

source: There’s no hard and fast answer.
es_es: No hay una respuesta rígida.

source: These are the building blocks for lingerie.
es_es: Estos son los componentes básicos de la lencería.

source: These are the special elements that help make lingerie look so sexy.
es_es: Estos son los elementos especiales que contribuyen a que la lencería resulte tan sexy.

source: These fibers have an excellent moisture removal or wicking quality and are easy to care for.
es_es: Las microfibras eliminan muy bien la humedad y son fáciles de cuidar.

source: These materials are what makes up your favorite fabric - whether it's a fishnet made from 100% nylon or a mesh made from a polyester and spandex blend.
es_es: Estos materiales son los que componen tu tejido favorito, ya sea una redecilla hecha 100% de nailon o una malla fabricada con una mezcla de poliéster y elastano.

source: These materials go by many different names including Cyberskin, UR3 and PureSkin, but most of them contain “skin” in the name.
es_es: Estos materiales reciben muchos nombres diferentes, como Cyberskin, UR3 y PureSkin, pero la mayoría incluyen "piel" en el nombre.

source: These toys feature narrow, tight tunnels.
es_es: Estos juguetes tienen túneles estrechos y apretados.

source: These toys target multiple erogenous zones at the same time for unbelievable stimulation.
es_es: Estos juguetes se dirigen a múltiples zonas erógenas al mismo tiempo para una estimulación increíble.

source: They can be made from one or more different materials.
es_es: Pueden estar hechos de uno o varios materiales diferentes.

source: They can make giving birth easier and help you recover faster.
es_es: Pueden hacer dar a luz más fácil y ayudarte a recuperarte más rápidamente.

source: They could turn the vibrating egg on at any time – while you’re riding in the car, ordering food, watching a movie or dancing in a club.
es_es: Puede encender el huevo vibrador en cualquier momento: mientras vais en el coche, pedís comida, veis una película o bailáis en una discoteca.

source: They vary in size and weight, but they're generally comparable to large marbles or small golf balls.
es_es: Su tamaño y peso varía, pero generalmente se pueden comparar con canicas grandes o bolas de golf pequeñas.

source: They’re guaranteed to work on all types of sex toy materials.
es_es: Garantizan su eficacia con todo tipo de materiales.

source: This adults-only game is designed for two players.
es_es: Este juego sólo para adultos está diseñado para dos jugadores.

source: This can help intensify your workout and provide gentle stimulation as you wear them.
es_es: Esto puede ayudar a intensificar su entrenamiento y proporcionar una estimulación suave mientras las lleva puestas.

source: This cute kegel training set makes working out your pelvic floor muscles so easy, so stimulating, and so much fun.
es_es: Este bonito set de entrenamiento kegel hace que ejercitar los músculos del suelo pélvico sea muy fácil, estimulante y divertido.

source: This helps your body warm up and adjust.
es_es: Esto ayuda a que tu cuerpo entre en calor y se adapte.

source: This is absolutely essential for beginners and intermediate users.
es_es: Esto es absolutamente esencial para principiantes y usuarios intermedios.

source: This is due to what researchers call cues, the things that send you hurtling over those final obstacles.
es_es: Esto se debe a lo que los investigadores llaman "señales", las cosas que hacen que te lances sobre los últimos obstáculos.

source: This leads to faster and more effective results than just doing Kegel exercises without any balls.
es_es: Esto ayuda a tener resultados más rapidos y efectivos que solo hacer ejercicios de Kegel sin bolas.

source: This makes Kegel Balls ideal for foreplay.
es_es: Esto hace que las bolas de Kegel sean ideales para los preliminares.

source: This makes your Kegel Balls easy to remove when you're done.
es_es: De este modo, las bolas de Kegel son fáciles de extraer.

source: This man made material is designed to stretch, resist wrinkling and is durable, qualities that make it popular for blending with other fibers.
es_es: Este material artificial está diseñado para estirarse, resistir a las arrugas y ser duradero. Estas cualidades lo hacen popular para mezclarlo con otras fibras.

source: This method is quick, easy and budget-friendly.
es_es: Este método es rápido, sencillo y económico.

source: This motor generates a shaking or throbbing sensation that causes the entire sex toy to vibrate.
es_es: Este motor genera una sensación de vibración o palpitación que provoca la vibración del juguete sexual.

source: This old wives’ tale was just a poor attempt to discourage masturbation.
es_es: Este dicho popular no es más que un pobre intento de desalentar la masturbación.

source: This prevents the motor or battery from getting wet.
es_es: Así evitarás que el motor o la batería se mojen.

source: This slickness makes stroking smoother and more enjoyable than going dry.
es_es: El lubricante hace que las caricias sean más suaves y placenteras que en seco.

source: This two-player game sets you both racing your pieces around a game board filled with exciting questions, naughty fantasies, and steamy dares.
es_es: Este juego para dos jugadores os pone a ambos a competir con vuestras piezas en un tablero de juego lleno de preguntas excitantes, fantasías traviesas y atrevidos retos.

source: This varies from person to person depending on what turns you on.
es_es: Esto varía de una persona a otra en función de lo que le excite.

source: This versatile kegel training set lets you choose the level of your workout.
es_es: Este versátil set de entrenamiento kegel te permite elegir el nivel de tu entrenamiento.

source: This weight rolls and shifts around as you move, creating a slight shaking sensation like gentle vibrations.
es_es: Los pesos ruedan y se mueven cuando te mueves, creando una ligera sensación de agitación como pequeñas vibraciones.

source: Those are your kegels at work.
es_es: Son tus kegels en acción.

source: To clean, pop the balls out of the silicone cradles and clean each with mild soap and water or toy cleaner.
es_es: Para limpiarlas, saca las bolas de los soportes de silicona y límpialas con agua y jabón suave o con un limpiador de juguetes.

source: To play, take turns rolling the die to move around the game board.
es_es: Para jugar, lanza el dado por turnos y muévete por el tablero.

source: To put it simply, masturbation is touching yourself for the purposes of sexual pleasure.
es_es: En pocas palabras, la masturbación consiste en tocarse a uno mismo con el objetivo de alcanzar el placer sexual.

source: To use, turn on Eve’s Ravishing Rose Pleaser with the simple control button.
es_es: Para usarlo, enciende Eve's Ravishing Rose Pleaser con el sencillo botón de control.

source: Train Your Way To Your Best Ohh’s Ever!
es_es: ¡Entrena tu camino hacia los mejores Ohh's de tu vida!

source: Trust us – this is one very naughty game worth winning.
es_es: Confía en nosotros: es un juego muy travieso que merece la pena ganar.

source: Try the vibe in the tub to turn your bath time into playtime or during your morning shower to start the day with a smile.
es_es: Prueba el vibrador en la bañera para darle juego al baño o durante la ducha matutina para empezar el día con una sonrisa.

source: Turn the balls off and apply water-based lube, making sure to completely cover them.
es_es: Apaga las bolas y aplica lubricante a base de agua, asegurándote de cubrirlas completamente.

source: Turn the balls on, starting with the lowest setting.
es_es: Enciende las bolas, empezando por el ajuste más bajo.

source: Turn them on and test the vibrations against the tip of your nose to see how strong they are and get a feeling for their power.
es_es: Enciéndelas y prueba las vibraciones contra la punta de la nariz para ver su intensidad y hacerte una idea de su potencia.
